---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.RoomSeparationLinesOverlap
source: html/a63a1a21-d01c-f778-3481-a9d0901037bb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.RoomSeparationLinesOverlap Property

Highlighted room separation lines overlap. One of them may be ignored when Revit finds room boundaries. Delete one of the lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomSeparationLinesOverlap { get; }
```